---

C#Visual BasicVisual C++

Revit 2024 API
---
Category..::..Material Property
Category Class See Also Send Feedback
---

Retrieves or changes the material of the category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public Material Material { get; set; }

Visual Basic
---

    Public Property Material As Material
    	Get
    	Set

Visual C++
---

    public:
    property Material^ Material {
    	Material^ get ();
    	void set (Material^ value);
    }

#### Field Value

nullNothingnullptra null reference (Nothing in Visual Basic) if this category does not have a material.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: material cannot be set for annotation categories. |

# See Also

Category Class

Autodesk.Revit.DB Namespace